[
{ "id": 0, "Arabic": "﷽", 
"translation": "In the Name of Allah, The Most Beneficent, The Most Merciful" },
{ "id": 1, "Arabic": "  سَلَامٌ علٰى عِبَادِهِ الَّذِينَ اصْطَفَى ، سَلَامٌ عَلَى الْمُرْسَلِينَ", "translation": "Peace be upon His chosen servants, Peace be upon the messengers" }
,
{"id": 2 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ وَّ أَنْزِلْهُ اَلْمَقْعَدَ الْمُقَرَّبَ عِنْدَكَ"
,
"translation": "O Allah, bestow mercy unto Muhammad (ﷺ) and the family of Muhammad (ﷺ) and grant him his resting place in proximity to You."
},
{"id": 3 ,
"Arabic": "اَللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ الْقَآئِمَةِ وَ الصَّلٰوةِ النَّافِعَةِ صَلِّ علٰى مُحَمَّدٍ وَّارْضَ عَنِّي رِضًا لَّا تَسْخَطُ بَعْدَهُ أَبَدًا"
,
"translation":"O Allah, Sustainer of this lasting call to prayer and this beneficial prayer, bestow mercy upon Muhammad (ﷺ) and be pleased with me in such a manner that never again will you be displeased with me"
},
{"id": 4 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ عَبْدِكَ وَ رَسُوْلِكَ وَ صَلِّ عَلَى الْمُؤْمِنِيْنَ وَ الْمُؤْمِنَاتِ وَ الْمُسْلِمِيْنَ وَ الْمُسْلِمَاتِ"
,
"translation":"O Allah, bestow Thy special mercy upon Muhammad (ﷺ), Your bondsman and messenger, and shower mercy upon the believers, male and female, and to all Muslims, male and female"
},
{"id": 5 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ وَّ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ وَّارْحَمْ مُحَمَّدًا وَّ آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ وَ بَارَكْتَ وَ رَحِمْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) and shower blessings on Muhammad (ﷺ) and the family of Muhammad (ﷺ) and have mercy on Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy, showered blessings and mercy upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious"
},
{"id": 6 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon the family of Ibrahim. Verily You are praised, glorious. O Allah, shower blessings upon Muhammad (ﷺ), and the family of Muhammad (ﷺ) as You did shower blessings upon the family of Ibrahim. Verily You are praised, glorious."
},
{"id": 7 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon the family of Ibrahim. Verily You are praised, glorious. And shower blessings on Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did shower blessings upon the family of Ibrahim. Verily You are praised, glorious"
},
{"id": 8 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim. Verily You are praised, glorious. O Allah, shower blessings on Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did shower blessings upon Ibrahim. Verily You are praised, glorious"
},
{"id": 9 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious. And shower blessings on Muhammad (ﷺ), and the family of Muhammad (ﷺ) as You did shower blessings upon Ibrahim. Verily You are praised, glorious"
},
{"id": 10 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim. And shower blessings upon Muhammad (ﷺ) and the family of Muhammad (ﷺ), as You did shower blessings upon Ibrahim. Verily You are praised, glorious"
},
{"id": 11 ,
"Arabic":  "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim. Verily You are praised, glorious. O Allah, shower blessings on Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did shower blessings upon the family of Ibrahim, Verily You are praised, glorious"
},
{"id": 12 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى آلِ إِبْرَاهِيْمَ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى آلِ إِبْرَاهِيْمَ فِى الْعَالَمِيْنَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ), as You did bestow mercy upon the family of Ibrahim. And shower blessings upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did shower blessings upon the family of Ibrahim in all the worlds. Verily You are praised, glorious"
},
{"id": 13 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ أَزْوَاجِهِ وَ ذُرِّيَّتِهِ كَمَا صَلَّيْتَ علٰى آلِ إِبْرَاهِيْمَ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ أَزْوَاجِهِ وَ ذُرِّيَّتِهِ كَمَا بَارَكْتَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation": "O Allah, bestow mercy upon Muhammad (ﷺ) and his wives and his offspring as You did bestow mercy upon the family of Ibrahim. And  hower blessings on Muhammad (ﷺ) and his wives and his offspring as You did shower blessings upon the family of Ibrahim. Verily You are praised, glorious."
},
{"id": 14 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى أَزْوَاجِهِ وَ ذُرِّيَّتِهِ كَمَا صَلَّيْتَ علٰى آلِ إِبْرَاهِيْمَ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى أَزْوَاجِهِ وَ ذُرِّيَّتِهِ كَمَا بَارَكْتَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and upon his wives and offspring as You did bestow mercy upon the family of Ibrahim. And shower blessings upon Muhammad (ﷺ) and upon wives and offspring as You did shower blessings upon the family of Ibrahim. Verily You are praised, glorious."
},
{"id": 15 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍۨ النَّبِيِّ وَ أَزْوَاجِهِ أُمَّهَاتِ الْمُؤْمِنِيْنِ وَ ذُرِّيَّتِهِ وَ أَهْلِ بَيْتِهِ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) the Nabi and upon his wives the mothers of the believers and upon his offspring and his household as You did bestow mercy upon Ibrahim. Verily You are praised, glorious."
},
{"id": 16 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ وَ تَرَحَّمْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا تَرَحّّمْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and upon the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim. And shower blessings upon Muhammad (ﷺ) and upon the family of Muhammad (ﷺ) as You did shower blessings upon Ibrahim. Verily You are praised, glorious."
},
{"id": 17 ,
"Arabic": " اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ تَرَحَّمْ علٰى  آلِ مُحَمَّدٍ كَمَا تَرَحَّمْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ تَحَنَّنْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا تَحَنَّنْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ سَلِّمْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا سَلَّمْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ "
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious. O Allah, shower blessings on Muhammad (ﷺ) and the family of Muhammad (ﷺ), as You did shower blessings upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious. O Allah, shower mercy on Muhammad (ﷺ) and the family of Muhammad (ﷺ), as You did shower mercy upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious. O Allah, be compassionate on Muhammad (ﷺ) and the family of Muhammad (ﷺ), as You were compassionate upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious. O Allah, bestow peace on Muhammad (ﷺ) and the family of Muhammad (ﷺ), as You did bestow peace upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious"
},
{"id": 18 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ وَّ بَارِكْ وَ سَلِّمْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ وَّارْحَمْ مُحَمَّدًا وَّ آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ وَ بَارَكْتَ وَ تَرَحَّمْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ فِى اَلْعَالَمِيْنَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) and shower blessings and greetings on Muhammad (ﷺ) and the family of Muhammad (ﷺ). And have mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You showered mercy and blessings and bestowed grace upon Ibrahim and the family of Ibrahim in the worlds. Verily You are praised, glorious"
},
{"id": 19 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious. O Allah, shower blessings on Muhammad (ﷺ) and the family of Muhammad (ﷺ), as You did shower blessings upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious"
},
{"id": 20 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ عَبْدِكَ وَ رَسُوْلِكَ كَمَا صَلَّيْتَ علٰى آلِ إِبْرَاهِيْمَ وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى آلِ إِبْرَاهِيْمَ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) Your bondsman and Your messenger as You did bestow mercy upon the family of Ibrahim and shower blessings upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow mercy upon the family of Ibrahim"
},
{"id": 21 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍۨ النَّبِيِّ الْأمِّيِّ وَ علٰى  آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ وَ بَارِكْ علٰى مُحَمَّدٍۨ النَّبِيِّ الْأُمِّيِّ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) the unletterd Nabi and upon the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim and shower blessings upon Muhammad (ﷺ) the unletterd Nabi as You did shower blessings upon Ibrahim. Verily You are praised, glorious"
},
{"id": 22 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ عَبْدِكَ وَ رَسُوْلِكَ النَّبِيِّ الْأُمِّيِّ وَ علٰى  آلِ مُحَمَّدٍ، اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ صَلٰوةً تَكُوْنُ لَكَ رِضًى وَّ لَهُ جَزَآءً وَّ لِحَقِّهِ أَدَآءً وَّ اَعْطِهِ الْوَسِيْلَةَ وَ الْفَضِيْلَةَ وَ الْمَقَامَ الْمَحْمُوْدۨ الَّذِيْ وَعَدْتَّهُ وَاجْزِهِ عَنَّا مَا هُوَ أَهْلُهُ وَاجْزِهِ أَفْضَلَ مَا جَازَيْتَ نَبِيًّا عَنْ قَوْمِهِ وَ رَسُوْلاً عَنْ أُمَّتِهِ، وَ صَلِّ علٰى جَمِيْعِ إِخْوَانِهِ مِنَ النَّبِيِّيْنَ وَ الصَّالِحِيْنَ يَا أَرْحَمَ الرَّاحِمِيْنَ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) , Your bondsman and Your messenger, the unlettered Nabi and upon the family of Muhammad (ﷺ). O Allah, bestow mercy upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) such a mercy which may lead to Your pleasure and be a full reward for him, and which may discharge his obligation towards You. And grant unto him the position of an intermediary and the highest position and the Praised Post which You have promised. And grant unto him a befitting recompense on our behalf, the best recompense which You have ever granted a Nabi on behalf of his people and granted a messenger on behalf of his followers. And bestow Your mercy on all his brothers among the Ambiyaa and the righteous ones, O You Most Merciful, Most Compassionate"
},
{"id": 23 ,
"Arabic": "اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍۨ النَّبِيِّ الْأُمِّيِّ وَ علٰى  آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ، وَ بَارِكْ علٰى مُحَمَّدٍۨ النَّبِيِّ الْأُمِّيِّ وَ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) the unletterd Nabi and upon the family of Muhammad (ﷺ) as You did bestow mercy upon Ibrahim and the family of Ibrahim. And shower blessings upon Muhammad (ﷺ) the unletterd Nabi and upon the family of Muhammad (ﷺ) as You did shower blessings upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious"
},
{"id": 24 ,
"Arabic": " اَللَّهُمَّ صَلِّ علٰى مُحَمَّدٍ وَّ علٰى أَهْلِ بَيْتِهِ كَمَا صَلَّيْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ صَلِّ عَلَيْنَا مَعَهُمْ، اَللَّهُمَّ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى أَهْلِ بَيْتِهِ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ عَلَيْنَا مَعَهُمْ، صَلَوَاتُ اللَّهِ وَ صَلَوَاتُ الْمُؤْمِنِيْنَ علٰى مُحَمَّدٍۨ النَّبِيِّ الْأُمِّيِّ"
,
"translation":"O Allah, bestow mercy upon Muhammad (ﷺ) and upon the members of his household as You did bestow mercy upon Ibrahim. Verily You are praised, glorious. O Allah, bestow mercy on us with them. O Allah, shower blessings upon Muhammad (ﷺ) and his household as You did shower blessings upon Ibrahim. Verily You are praised, glorious. O Allah, shower blessings on us with them. May the numerous mercies of Allah and the numerous supplications of the believers be upon Muhammad (ﷺ), the unlettered Nabi"
},
{"id": 25 ,
"Arabic": "اَللَّهُمَّ اجْعَلْ صَلَوَاتِكَ وَ رَحْمَتَكَ وَ بَرَكَاتِكَ علٰى مُحَمَّدٍ وَّ آلِ مُحَمَّدٍ كَمَا جَعَلْتَهَا علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، وَ بَارِكْ علٰى مُحَمَّدٍ وَّ علٰى  آلِ مُحَمَّدٍ كَمَا بَارَكْتَ علٰى إِبْرَاهِيْمَ وَ علٰى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ"
,
"translation":"O Allah, bestow Your mercy and Your grace and Your blessings upon Muhammad (ﷺ) and the family of Muhammad (ﷺ) as You did bestow it upon the family of Ibrahim. Verily You are praised, glorious. And shower blessings upon Muhammad (ﷺ) and upon the family of Muhammad (ﷺ), as You did shower blessings upon Ibrahim and the family of Ibrahim. Verily You are praised, glorious."
},
{"id": 26 ,
"Arabic": "وَ صَلَّى اللَّهُ  عَلَى النَّبِيِّ الْأُمِّيِّ"
,
"translation":"May Allah bestow mercy on the unlettered Nabi"
},
{"id": 27 ,
"Arabic": "اَلتَّحِيَّاتُ لِلَّهِ وَ الصَّلَوَاتُ وَ الطَّيِّبَاتُ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ"
,
"translation":"All verbal praises are for Allah and all physical and monetary devotions (are for Allah). Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all righteous the servants of Allah. I bear witness that none is worthy of worship besides Allah, and I bear witness that Muhammad (ﷺ) is his bondsman and His messenger"
},
{"id": 28 ,
"Arabic": "اَلتَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ"
,
"translation":"All verbal praises, all monetary devotions, all physical worship are for Allah, peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. I bear witness that none is worthy of worship besides Allah, and I bear witness that Muhammad (ﷺ) is his bondsman and His messenger"
},
{"id": 29 ,
"Arabic": "اَلتَّحِيَّاتُ لِلَّهِ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ"
,
"translation":"All verbal praises are for Allah, all monetary devotions, all physical worship are for Allah, peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. I bear witness that none is worthy of worship besides Allah, He is alone, He has no partner and I bear witness that Muhammad (ﷺ) is his bondsman and His messenger"
},
{"id": 30 ,
"Arabic": "اَلتَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ، سَلَامٌ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، سَلَامٌ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ "
,
"translation":"All verbally blessed praises, all physical worship all monetary devotions are for Allah, peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. I bear witness that none is worthy of worship besides Allah and I bear witness that Muhammad (ﷺ) is his bondsman and His messenger"
},
{"id": 31 ,
"Arabic": "بِسْمِ اللَّهِ وَ بِاللَّهِ، اَلتَّحِيَّاتُ لِلَّهِ وَ الصَّلَوَاتُ وَ الطَّيِّبَاتُ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَاهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ، أَسْأَلُ اللَّهَ الْجَنَّةَ وَ أَعُوْذُ بِاللَّهِ مِنَ النَّارِ"
,
"translation":"I begin in the name of Allah, and I begin with Allah’s blessings to do good. All verbal praises are for Allah, and all physical and monetary worship (are for Allah). Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. I bear witness that none is worthy of worship besides Allah and I bear witness that Muhammad (ﷺ) is his bondsman and His messenger. I beg Allah for Jannat and I seek protection with Allah from the fire"
},
{"id": 32 ,
"Arabic": " اَلتَّحِيَّاتُ الزَّاكِيَاتُ لِلَّهِ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ  "
,
"translation":"All purest verbal praises are for Allah, all monetary devotions and physical worship are for Allah. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. I bear witness that none is worthy of worship besides Allah and I bear witness that Muhammad (ﷺ) is his bondsman and His messenger"
},
{"id": 33 ,
"Arabic": "بِسْمِ اللَّهِ وَ بِاللَّهِ خَيْرِ الْأَسْمَاءِ، اَلتَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ، أَشْهَدُ أَنْ لَا إِلَاهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ، أَرْسَلَهُ بِالْحَقِّ بَشِيْرًا وَّ نَذِيْرًا، وَ أَنَّ السَّاعَةَ آتِيَةٌ لَا رَيْبَ فِيْهَا، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، اَللَّهُمَّ اغْفِرْ لِي وَ اهْدِنِي"
,
"translation":"I begin in the name of Allah, and I begin with Allah’s blessings to do good work. Whose name is the best among all names. All verbal praises, monetary devotions, physical and worship are for Allah. I bear witness that none is worthy of worship besides Allah and I bear witness that Muhammad (ﷺ) is his bondsman and His messenger. He was sent with the truth, giving good tidings (for the obedient) and warner (for the disobedient). And (I bear witness) that the day of Judgement has to come without doubt. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. O Allah forgive me and guide me."
},
{"id":  34,
"Arabic": "اَلتَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ وَ الْمُلْكُ لِلَّهِ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ"
,
"translation":"All verbal praises, monetary devotions, physical and worship and the kingdom (of heaven and earth) belong to Allah. Peace be upon you O Prophet, and the mercy of Allah and His blessings"
},
{"id": 35 ,
"Arabic": "بِسْمِ اللَّهِ، اَلتَّحِيَّاتُ لِلَّهِ الصَّلَوَاتُ لِلَّهِ الزَّاكِيَاتُ لِلَّهِ، اَلسَّلَامُ علَى النَّبِيِّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، شَهِدْتُ أَنْ لاَ إِلَاهَ إِلَّا اللَّهُ شَهِدْتُ أَنَّ مُحَمَّدًا رَسُوْلُ اللَّهِ"
,
"translation":"I begin in the name of Allah. All verbal praises are for Allah. All physical worship is for Allah. All purities (in worship) are for Allah. Peace be upon the Prophet and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. I have borne witness that Muhammad (ﷺ) is Allah’s messenger"
},
{"id": 36 ,
"Arabic": "اَلتَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ، أَشْهَدُ أَنْ لَا إِلَاهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ وَ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ"
,
"translation":"All verbal praises, all monetary devotions, all physical worship and all purities are for Allah. I bear witness that none is worthy of worship besides Allah. He is alone, He has no partner and that Muhammad (ﷺ) is His bondsman and His messenger. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah"
},
{"id":37  ,
"Arabic": "اَلتَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ الزَّاكِيَاتُ لِلَّهِ، أَشْهَدُ أَنْ لَا إِلَاهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُ اللَّهِ وَ رَسُوْلُهُ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ"
,
"translation":"All verbal praises, all monetary devotions, all physical worship and all purities are for Allah. I bear witness that none is worthy of worship besides Allah and I bear witness that Muhammad (ﷺ) is Allah’s bondsman and His messenger. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah"
},
{"id":38  ,
"Arabic": "اَلتَّحِيَّاتُ الصَّلَوَاتُ لِلَّهِ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ"
,
"translation":"All verbal praises, all physical worship are for Allah. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah"
},
{"id": 39 ,
"Arabic": " اَلتَّحِيَّاتُ لِلَّهِ الصَّلَوَاتُ الطَّيِّبَاتُ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَ أَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَ رَسُوْلُهُ "
,
"translation":"All verbal praises are for Allah, all physical worship, all monetary devotions (are for Allah). Peace be upon you O Prophet, and the mercy of Allah. Peace be upon us and all the righteous servants of Allah. I bear witness that none is worthy of worship besides Allah and I bear witness that Muhammad (ﷺ) is His bondsman and His messenger"
},
{"id": 40 ,
"Arabic": "اَلتَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ ، اَلسَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ، اَلسَّلَامُ عَلَيْنَا وَ علٰى عِبَادِ اللَّهِ الصَّالِحِيْنَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُوْلُ اللَّهِ"
,
"translation":"All verbally blessed praises, all physical worship, all monetary devotions are for Allah. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and all the righteous servants of Allah. I bear witness that none is worthy of worship besides Allah and I bear witness that Muhammad (ﷺ) is Allah’s bondsman and His messenger"
},
{"id": 41 ,
"Arabic": "بِسْمِ اللَّهِ وَ اَلسَّلَامُ علٰى رَسُوْلِ اللَّهِ"
,
"translation":"I begin in the name of Allah and peace be upon Rasulullah"
}
]
